# IFCLevelInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo Class
Members See Also
---
Represents information about a particular level in the document.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class IFCLevelInfo : IDisposable
```

Visual Basic
---
```text
Public Class IFCLevelInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCLevelInfo : IDisposable
```

# Remarks
Level information includes the height, which is the distance to from this level to the next available level, and the actual elevation of the level, in the Revit default units.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCLevelInfo
# See Also
IFCLevelInfo Members
Autodesk.Revit.DB.IFC Namespace